contrib-imola/corba-bc/jbi4corba/src/test/resources/xmlmessages/testEchoMessage.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
	<SOAP-ENV:Body>
		<m:echo xmlns:m="it.imolinfo.jbi4corba.test.webservice.generator">
			<m:in0>Hello World</m:in0>
		</m:echo>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
